MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25J50/mcu.h
extern volatile __bit                   CAL4                __at(0x79F4);	// @ (0xF3E * 8 + 4)
#define                                 CAL4_bit            _BIT_ACCESS(RTCCAL,4)
// RTCCAL<CAL5>
extern volatile __bit                   CAL5                __at(0x79F5);	// @ (0xF3E * 8 + 5)
#define                                 CAL5_bit            _BIT_ACCESS(RTCCAL,5)
// RTCCAL<CAL6>
extern volatile __bit                   CAL6                __at(0x79F6);	// @ (0xF3E * 8 + 6)
#define                                 CAL6_bit            _BIT_ACCESS(RTCCAL,6)
// RTCCAL<CAL7>
extern volatile __bit                   CAL7                __at(0x79F7);	// @ (0xF3E * 8 + 7)
#define                                 CAL7_bit            _BIT_ACCESS(RTCCAL,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CM1CON<CCH0>
extern volatile __bit _DEPRECATED       CCH0                __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 CCH0_bit            _BIT_ACCESS(CM1CON,0)
// CM1CON<CCH01>
extern volatile __bit                   CCH01               __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 CCH01_bit           _BIT_ACCESS(CM1CON,0)
// CM2CON<CCH02>
extern volatile __bit                   CCH02               __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 CCH02_bit           _BIT_ACCESS(CM2CON,0)
// CM1CON<CCH1>
extern volatile __bit _DEPRECATED       CCH1                __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 CCH1_bit            _BIT_ACCESS(CM1CON,1)
// CM1CON<CCH11>
extern volatile __bit                   CCH11               __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 CCH11_bit           _BIT_ACCESS(CM1CON,1)
// CM2CON<CCH12>
extern volatile __bit                   CCH12               __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 CCH12_bit           _BIT_ACCESS(CM2CON,1)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7DA0);	// @ (0xFB4 * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7DA1);	// @ (0xFB4 * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7DA2);	// @ (0xFB4 * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7DA3);	// @ (0xFB4 * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// ALRMCFG<CHIME>
extern volatile __bit                   CHIME               __at(0x7C8E);	// @ (0xF91 * 8 + 6)
#define                                 CHIME_bit           _BIT_ACCESS(ALRMCFG,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK1>
extern volatile __bit                   CK1                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK1_bit             _BIT_ACCESS(PORTC,6)
// SSP1STAT<CKE>
extern volatile __bit _DEPRECATED       CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSP1STAT,6)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x7B9E);	// @ (0xF73 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP>
extern volatile __bit _DEPRECATED       CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSP1CON1,4)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// BAUDCON1<CKTXP>
extern volatile __bit                   CKTXP               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 CKTXP_bit           _BIT_ACCESS(BAUDCON1,4)
// PORTA<CLKI>
extern volatile __bit                   CLKI                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 CLKI_bit            _BIT_ACCESS(PORTA,7)
// PORTA<CLKO>
extern volatile __bit                   CLKO                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 CLKO_bit            _BIT_ACCESS(PORTA,6)
// RCON<CM>
extern volatile __bit                   CM                  __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 CM_bit              _BIT_ACCESS(RCON,5)
// PIE2<CM1IE>
extern volatile __bit                   CM1IE               __at(0x7D05);	// @ (0xFA0 * 8 + 5)
#define                                 CM1IE_bit           _BIT_ACCESS(PIE2,5)
// PIR2<CM1IF>
extern volatile __bit                   CM1IF               __at(0x7D0D);	// @ (0xFA1 * 8 + 5)
#define                                 CM1IF_bit           _BIT_ACCESS(PIR2,5)
// IPR2<CM1IP>
extern volatile __bit                   CM1IP               __at(0x7D15);	// @ (0xFA2 * 8 + 5)
#define                                 CM1IP_bit           _BIT_ACCESS(IPR2,5)
// PIE2<CM2IE>
extern volatile __bit                   CM2IE               __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CM2IE_bit           _BIT_ACCESS(PIE2,6)
// PIR2<CM2IF>
extern volatile __bit                   CM2IF               __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CM2IF_bit           _BIT_ACCESS(PIR2,6)
// IPR2<CM2IP>
extern volatile __bit                   CM2IP               __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CM2IP_bit           _BIT_ACCESS(IPR2,6)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// PSTR1CON<CMPL0>
extern volatile __bit _DEPRECATED       CMPL0               __at(0x7DFE);	// @ (0xFBF * 8 + 6)
#define                                 CMPL0_bit           _BIT_ACCESS(PSTR1CON,6)
// PSTR2CON<CMPL02>
extern volatile __bit                   CMPL02              __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 CMPL02_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR1CON<CMPL1>
extern volatile __bit _DEPRECATED       CMPL1               __at(0x7DFF);	// @ (0xFBF * 8 + 7)
#define                                 CMPL1_bit           _BIT_ACCESS(PSTR1CON,7)
// PSTR2CON<CMPL12>
extern volatile __bit                   CMPL12              __at(0x7DCF);	// @ (0xFB9 * 8 + 7)
#define                                 CMPL12_bit          _BIT_ACCESS(PSTR2CON,7)
// CM1CON<COE>
extern volatile __bit _DEPRECATED       COE                 __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 COE_bit             _BIT_ACCESS(CM1CON,6)
// CM1CON<COE1>
extern volatile __bit                   COE1                __at(0x7E96);	// @ (0xFD2 * 8 + 6)
#define                                 COE1_bit            _BIT_ACCESS(CM1CON,6)
// CM2CON<COE2>
extern volatile __bit                   COE2                __at(0x7E8E);	// @ (0xFD1 * 8 + 6)
#define                                 COE2_bit            _BIT_ACCESS(CM2CON,6)
// CM1CON<CON>
extern volatile __bit _DEPRECATED       CON                 __at(0x7E97);	// @ (0xFD2 * 8 + 7)
#define                                 CON_bit             _BIT_ACCESS(CM1CON,7)
// CM1CON<CON1>
extern volatile __bit                   CON1                __at(0x7E97);	// @ (0xFD2 * 8 + 7)
#define                                 CON1_bit            _BIT_ACCESS(CM1CON,7)
// CM2CON<CON2>
extern volatile __bit                   CON2                __at(0x7E8F);	// @ (0xFD1 * 8 + 7)
#define                                 CON2_bit            _BIT_ACCESS(CM2CON,7)
// CMSTAT<COUT1>
extern volatile __bit                   COUT1               __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 COUT1_bit           _BIT_ACCESS(CMSTAT,0)
// CMSTAT<COUT2>
extern volatile __bit                   COUT2               __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 COUT2_bit           _BIT_ACCESS(CMSTAT,1)
// CM1CON<CPOL>
extern volatile __bit _DEPRECATED       CPOL                __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 CPOL_bit            _BIT_ACCESS(CM1CON,5)
// CM1CON<CPOL1>
extern volatile __bit                   CPOL1               __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 CPOL1_bit           _BIT_ACCESS(CM1CON,5)
// CM2CON<CPOL2>
extern volatile __bit                   CPOL2               __at(0x7E8D);	// @ (0xFD1 * 8 + 5)
#define                                 CPOL2_bit           _BIT_ACCESS(CM2CON,5)
// UEIE<CRC16EE>
extern volatile __bit                   CRC16EE             __at(0x79BA);	// @ (0xF37 * 8 + 2)
#define                                 CRC16EE_bit         _BIT_ACCESS(UEIE,2)
// UEIR<CRC16EF>
extern volatile __bit                   CRC16EF             __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 CRC16EF_bit         _BIT_ACCESS(UEIR,2)
// UEIE<CRC5EE>
extern volatile __bit                   CRC5EE              __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 CRC5EE_bit          _BIT_ACCESS(UEIE,1)
// UEIR<CRC5EF>
extern volatile __bit                   CRC5EF              __at(0x7B19);	// @ (0xF63 * 8 + 1)
#define                                 CRC5EF_bit          _BIT_ACCESS(UEIR,1)
// CM1CON<CREF>
extern volatile __bit _DEPRECATED       CREF                __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 CREF_bit            _BIT_ACCESS(CM1CON,2)
// CM1CON<CREF1>
extern volatile __bit                   CREF1               __at(0x7E92);	// @ (0xFD2 * 8 + 2)
#define                                 CREF1_bit           _BIT_ACCESS(CM1CON,2)
// CM2CON<CREF2>
extern volatile __bit                   CREF2               __at(0x7E8A);	// @ (0xFD1 * 8 + 2)
#define                                 CREF2_bit           _BIT_ACCESS(CM2CON,2)
// RCSTA1<CREN>
extern volatile __bit _DEPRECATED       CREN                __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA1,4)
// RCSTA1<CREN1>
extern volatile __bit                   CREN1               __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 CREN1_bit           _BIT_ACCESS(RCSTA1,4)
// RCSTA2<CREN2>
extern volatile __bit                   CREN2               __at(0x7CE4);	// @ (0xF9C * 8 + 4)
#define                                 CREN2_bit           _BIT_ACCESS(RCSTA2,4)
// TXSTA1<CSRC>
extern volatile __bit _DEPRECATED       CSRC                __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA1,7)
// TXSTA1<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D6F);	// @ (0xFAD * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA1,7)
// TXSTA2<CSRC2>
extern volatile __bit                   CSRC2               __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 CSRC2_bit           _BIT_ACCESS(TXSTA2,7)
// PORTB<CTEDG1>
extern volatile __bit                   CTEDG1              __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 CTEDG1_bit          _BIT_ACCESS(PORTB,2)
// PORTB<CTEDG2>
extern volatile __bit                   CTEDG2              __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CTEDG2_bit          _BIT_ACCESS(PORTB,3)
// CTMUCONH<CTMUEN>
extern volatile __bit                   CTMUEN              __at(0x7D9F);	// @ (0xFB3 * 8 + 7)
#define                                 CTMUEN_bit          _BIT_ACCESS(CTMUCONH,7)
// PIE3<CTMUIE>
extern volatile __bit                   CTMUIE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 CTMUIE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CTMUIF>
extern volatile __bit                   CTMUIF              __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 CTMUIF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<CTMUIP>
extern volatile __bit                   CTMUIP              __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 CTMUIP_bit          _BIT_ACCESS(IPR3,2)
// CTMUCONH<CTMUSIDL>
extern volatile __bit                   CTMUSIDL            __at(0x7D9D);	// @ (0xFB3 * 8 + 5)
#define                                 CTMUSIDL_bit        _BIT_ACCESS(CTMUCONH,5)
// PORTC<CTPLS>
extern volatile __bit                   CTPLS               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CTPLS_bit           _BIT_ACCESS(PORTC,2)
// CTMUCONH<CTTRIG>
extern volatile __bit                   CTTRIG              __at(0x7D98);	// @ (0xFB3 * 8 + 0)
#define                                 CTTRIG_bit          _BIT_ACCESS(CTMUCONH,0)
// CVRCON<CVR0>
extern volatile __bit                   CVR0                __at(0x7A98);	// @ (0xF53 * 8 + 0)
#define                                 CVR0_bit            _BIT_ACCESS(CVRCON,0)
// CVRCON<CVR1>
extern volatile __bit                   CVR1                __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 CVR1_bit            _BIT_ACCESS(CVRCON,1)
// CVRCON<CVR2>
extern volatile __bit                   CVR2                __at(0x7A9A);	// @ (0xF53 * 8 + 2)
#define                                 CVR2_bit            _BIT_ACCESS(CVRCON,2)
// CVRCON<CVR3>
extern volatile __bit                   CVR3                __at(0x7A9B);	// @ (0xF53 * 8 + 3)
#define                                 CVR3_bit            _BIT_ACCESS(CVRCON,3)
// PORTA<CVREF_MINUS>
extern volatile __bit                   CVREF_MINUS         __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 CVREF_MINUS_bit     _BIT_ACCESS(PORTA,2)
// CVRCON<CVREN>
extern volatile __bit                   CVREN               __at(0x7A9F);	// @ (0xF53 * 8 + 7)
#define                                 CVREN_bit           _BIT_ACCESS(CVRCON,7)
// CVRCON<CVROE>
extern volatile __bit                   CVROE               __at(0x7A9E);	// @ (0xF53 * 8 + 6)
#define                                 CVROE_bit           _BIT_ACCESS(CVRCON,6)
// CVRCON<CVROEN>
extern volatile __bit                   CVROEN              __at(0x7A9E);	// @ (0xF53 * 8 + 6)
#define                                 CVROEN_bit          _BIT_ACCESS(CVRCON,6)
// CVRCON<CVRR>
extern volatile __bit                   CVRR                __at(0x7A9D);	// @ (0xF53 * 8 + 5)
#define                                 CVRR_bit            _BIT_ACCESS(CVRCON,5)
// CVRCON<CVRSS>
extern volatile __bit                   CVRSS               __at(0x7A9C);	// @ (0xF53 * 8 + 4)
#define                                 CVRSS_bit           _BIT_ACCESS(CVRCON,4)
// SSP1STAT<D1>
extern volatile __bit                   D1                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 D1_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SSP1STAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP1STAT<DATA_ADDRESS1>
extern volatile __bit                   DATA_ADDRESS1       __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS1_bit   _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x7EC1);	// @ (0xFD8 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x7DD4);	// @ (0xFBA * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x7DD5);	// @ (0xFBA * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// UEIE<DFN8EE>
extern volatile __bit                   DFN8EE              __at(0x79BB);	// @ (0xF37 * 8 + 3)
#define                                 DFN8EE_bit          _BIT_ACCESS(UEIE,3)
// UEIR<DFN8EF>
extern volatile __bit                   DFN8EF              __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 DFN8EF_bit          _BIT_ACCESS(UEIR,3)
// USTAT<DIR>
extern volatile __bit                   DIR                 __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 DIR_bit             _BIT_ACCESS(USTAT,2)
// DMACON2<DLYCYC0>
extern volatile __bit                   DLYCYC0             __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 DLYCYC0_bit         _BIT_ACCESS(DMACON2,4)
// DMACON2<DLYCYC1>
extern volatile __bit                   DLYCYC1             __at(0x7C35);	// @ (0xF86 * 8 + 5)
#define                                 DLYCYC1_bit         _BIT_ACCESS(DMACON2,5)
// DMACON2<DLYCYC2>
extern volatile __bit                   DLYCYC2             __at(0x7C36);	// @ (0xF86 * 8 + 6)
#define                                 DLYCYC2_bit         _BIT_ACCESS(DMACON2,6)
// DMACON2<DLYCYC3>
extern volatile __bit                   DLYCYC3             __at(0x7C37);	// @ (0xF86 * 8 + 7)
#define                                 DLYCYC3_bit         _BIT_ACCESS(DMACON2,7)
// DMACON1<DLYINTEN>
extern volatile __bit                   DLYINTEN            __at(0x7C41);	// @ (0xF88 * 8 + 1)
